Repository: Nizhal/git-gui
Catalog: po/*.po
Languages: ta

source: Show a dialog before running
ta: இயங்குவதற்கு முன் ஒரு உரையாடலைக் காட்டு

source: Ask the user to select a revision (sets $REVISION)
ta: ஒரு திருத்தத்தைத் தேர்ந்தெடுக்க பயனரிடம் கேளுங்கள் (அமைக்கிறது $ திருத்தத்தை)

source: Ask the user for additional arguments (sets $ARGS)
ta: கூடுதல் வாதங்களை பயனரிடம் கேளுங்கள் (அமைக்கிறது $ args)

source: Don't show the command output window
ta: கட்டளை வெளியீட்டு சாளரத்தைக் காட்ட வேண்டாம்

source: Run only if a diff is selected ($FILENAME not empty)
ta: ஒரு வேறுபாடு தேர்ந்தெடுக்கப்பட்டால் மட்டுமே இயக்கவும் ($ கோப்பு பெயர் காலியாக இல்லை)

source: Please supply a name for the tool.
ta: கருவிக்கு ஒரு பெயரை வழங்கவும்.

source: Tool '%s' already exists.
ta: கருவி '%s' ஏற்கனவே உள்ளது.

source: Could not add tool: %s
ta: கருவிகளைச் சேர்க்க முடியவில்லை

source: %s (%s): Remove Tool
ta: %s (%s): கருவியை அகற்று

source: Remove Tool Commands
ta: கருவி கட்டளைகளை அகற்று

source: Remove
ta: அகற்று

source: (Blue denotes repository-local tools)
ta: (நீலம் களஞ்சிய-உள்ளூர் கருவிகளைக் குறிக்கிறது)

source: Run Command: %s
ta: கட்டளை ரன்: %s

source: Arguments
ta: வாதங்கள்

source: OK
ta: சரி

source: Find:
ta: கண்டுபிடி:

source: Next
ta: அடுத்தது

source: Prev
ta: முந்தைய

source: Case
ta: வழக்கு

source: %s (%s): Create Desktop Icon
ta: %s (%s): டெச்க்டாப் ஐகானை உருவாக்கவும்

source: Cannot write shortcut:
ta: குறுக்குவழியை எழுத முடியாது:

source: Cannot write icon:
ta: படவுரு எழுத முடியாது:

source: %s (%s): Delete Branch Remotely
ta: %s (%s): கிளையை தொலைவிலிருந்து நீக்கு

source: Delete Branch Remotely
ta: கிளையை தொலைவிலிருந்து நீக்கவும்

source: From Repository
ta: களஞ்சியத்திலிருந்து

source: Branches
ta: கிளைகள்

source: Delete Only If
ta: என்றால் மட்டும் நீக்கு

source: Merged Into:
ta: ஒன்றிணைந்தது:

source: Always (Do not perform merge checks)
ta: எப்போதும் (ஒன்றிணைக்கும் சோதனைகளைச் செய்ய வேண்டாம்)

source: A branch is required for 'Merged Into'.
ta: 'இணைக்க' ஒரு கிளை தேவை.

source: The following branches are not completely merged into %s: - %s
ta: பின்வரும் கிளைகள் %s இல் முழுமையாக இணைக்கப்படவில்லை: - %s

source: One or more of the merge tests failed because you have not fetched the necessary commits. Try fetching from %s first.
ta: ஒன்றிணைந்த சோதனைகளில் ஒன்று அல்லது அதற்கு மேற்பட்டவை தோல்வியடைந்தன, ஏனெனில் நீங்கள் தேவையான கமிட்டுகளைப் பெறவில்லை. முதலில் %s இலிருந்து பெற முயற்சிக்கவும்.

source: Please select one or more branches to delete.
ta: நீக்க ஒன்று அல்லது அதற்கு மேற்பட்ட கிளைகளைத் தேர்ந்தெடுக்கவும்.

source: Recovering deleted branches is difficult. Delete the selected branches?
ta: நீக்கப்பட்ட கிளைகளை மீட்டெடுப்பது கடினம். தேர்ந்தெடுக்கப்பட்ட கிளைகளை நீக்கவா?

source: Deleting branches from %s
ta: %s இலிருந்து கிளைகளை நீக்குதல்

source: No repository selected.
ta: எந்த களஞ்சியமும் தேர்ந்தெடுக்கப்படவில்லை.

source: Scanning %s...
ta: ச்கேனிங் %s ...

source: Git Gui
ta: அறிவிலி குய்

source: Create New Repository
ta: புதிய களஞ்சியத்தை உருவாக்கவும்

source: New...
ta: புதியது ...

source: Clone Existing Repository
ta: இருக்கும் களஞ்சியத்தை நகலி செய்யுங்கள்

source: Clone...
ta: நகலி ...

source: Open Existing Repository
ta: இருக்கும் களஞ்சியத்தைத் திறக்கவும்

source: Open...
ta: திறந்த ...

source: Recent Repositories
ta: அண்மைக் கால களஞ்சியங்கள்

source: Open Recent Repository:
ta: அண்மைக் கால களஞ்சியத்தைத் திறக்கவும்:

source: Failed to create repository %s:
ta: %s களஞ்சியத்தை உருவாக்குவதில் தோல்வி:

source: Create
ta: உருவாக்கு

source: Directory:
ta: அடைவு:

source: Git Repository
ta: அறிவிலி களஞ்சியம்

source: Directory %s already exists.
ta: அடைவு %s ஏற்கனவே உள்ளன.

source: File %s already exists.
ta: கோப்பு %s ஏற்கனவே உள்ளது.

source: Clone
ta: நகலி

source: Source Location:
ta: மூல இடம்:

source: Target Directory:
ta: இலக்கு அடைவு:

source: Clone Type:
ta: நகலி வகை:

source: Standard (Fast, Semi-Redundant, Hardlinks)
ta: தரநிலை (வேகமான, அரை-குறைப்பு, ஆர்ட்லிங்க்ச்)

source: Full Copy (Slower, Redundant Backup)
ta: முழு நகல் (மெதுவான, தேவையற்ற காப்புப்பிரதி)

source: Shared (Fastest, Not Recommended, No Backup)
ta: பகிரப்பட்டது (வேகமான, பரிந்துரைக்கப்படவில்லை, காப்புப்பிரதி இல்லை)

source: Recursively clone submodules too
ta: மீண்டும் மீண்டும் நகலி சப்மோடூல்கள்

source: Not a Git repository: %s
ta: ஒரு அறிவிலி களஞ்சியம் அல்ல: %s

source: Standard only available for local repository.
ta: உள்ளக களஞ்சியத்திற்கு மட்டுமே தரநிலை கிடைக்கிறது.

source: Shared only available for local repository.
ta: உள்ளக களஞ்சியத்திற்கு மட்டுமே பகிரப்பட்டது.

source: Location %s already exists.
ta: இருப்பிடம் %s ஏற்கனவே உள்ளன.

source: Failed to configure origin
ta: தோற்றத்தை உள்ளமைக்கத் தவறிவிட்டது

source: Counting objects
ta: பொருள்களை எண்ணுதல்

source: buckets
ta: வாளிகள்

source: Unable to copy objects/info/alternates: %s
ta: பொருள்கள்/தகவல்/மாற்றுகளை நகலெடுக்க முடியவில்லை: %s

source: Nothing to clone from %s.
ta: %s இலிருந்து நகலி செய்ய எதுவும் இல்லை.

source: The 'master' branch has not been initialized.
ta: 'மாச்டர்' கிளை துவக்கப்படவில்லை.

source: Hardlinks are unavailable. Falling back to copying.
ta: ஆர்ட்லிங்க்கள் கிடைக்கவில்லை. நகலெடுப்பதற்கு மீண்டும் விழுகிறது.

source: Cloning from %s
ta: %s இலிருந்து குளோனிங்

source: Copying objects
ta: பொருள்களை நகலெடுக்கும்

source: KiB
ta: வினோதமாக

source: Unable to copy object: %s
ta: பொருளை நகலெடுக்க முடியவில்லை: %s

source: Linking objects
ta: பொருள்களை இணைக்கும்

source: objects
ta: பொருள்கள்

source: Unable to hardlink object: %s
ta: ஆர்ட்லிங்க் பொருள்: %s

source: Cannot fetch branches and objects. See console output for details.
ta: கிளைகளையும் பொருள்களையும் பெற முடியாது. விவரங்களுக்கு கன்சோல் வெளியீட்டைப் பார்க்கவும்.

source: Cannot fetch tags. See console output for details.
ta: குறிச்சொற்களைப் பெற முடியாது. விவரங்களுக்கு கன்சோல் வெளியீட்டைப் பார்க்கவும்.

source: Cannot determine HEAD. See console output for details.
ta: தலையை தீர்மானிக்க முடியாது. விவரங்களுக்கு கன்சோல் வெளியீட்டைப் பார்க்கவும்.

source: Unable to cleanup %s
ta: %களை தூய்மை செய்ய முடியவில்லை

source: Clone failed.
ta: நகலி தோல்வியடைந்தது.

source: No default branch obtained.
ta: இயல்புநிலை கிளை எதுவும் பெறப்படவில்லை.

source: Cannot resolve %s as a commit.
ta: %s ஐ ஒரு உறுதிப்பாடாக தீர்க்க முடியாது.

source: Creating working directory
ta: வேலை கோப்பகத்தை உருவாக்குதல்

source: Initial file checkout failed.
ta: ஆரம்ப கோப்பு புதுப்பிப்பு தோல்வியடைந்தது.

source: Cloning submodules
ta: குளோனிங் சப்மோடூல்கள்

source: Cannot clone submodules.
ta: துணைமண்டலங்களை நகலி செய்ய முடியாது.

source: Repository:
ta: களஞ்சியம்:

source: Failed to open repository %s:
ta: களஞ்சியத்தை திறக்கத் தவறிவிட்டது %s:

source: git-gui - a graphical user interface for Git.
ta: GIT -GUI - GIT க்கான வரைகலை பயனர் இடைமுகம்.

source: %s (%s): File Viewer
ta: %s (%s): கோப்பு பார்வையாளர்

source: Commit:
ta: கமிட்:

source: Copy Commit
ta: நகல்

source: Find Text...
ta: உரையைக் கண்டுபிடி ...

source: Goto Line...
ta: கோட்டோ வரி ...

source: Do Full Copy Detection
ta: முழு நகல் கண்டறிதலைச் செய்யுங்கள்

source: Show History Context
ta: வரலாற்று சூழலைக் காட்டு

source: Blame Parent Commit
ta: குற்றம் சாட்டிய பெற்றோர்

source: Reading %s...
ta: %s படித்தல் ...

source: Loading copy/move tracking annotations...
ta: நகல்/நகரும் கண்காணிப்பு சிறுகுறிப்புகளை ஏற்றுகிறது ...

source: lines annotated
ta: கோடுகள் சிறுகுறிப்பு

source: Loading original location annotations...
ta: அசல் இருப்பிட சிறுகுறிப்புகளை ஏற்றுகிறது ...

source: Annotation complete.
ta: சிறுகுறிப்பு முடிந்தது.

source: Busy
ta: பிசியாக

source: Annotation process is already running.
ta: சிறுகுறிப்பு செயல்முறை ஏற்கனவே இயங்குகிறது.

source: Running thorough copy detection...
ta: முழுமையான நகல் கண்டறிதலை இயக்குகிறது ...

source: Loading annotation...
ta: சிறுகுறிப்பு ஏற்றுகிறது ...

source: Author:
ta: ஆசிரியர்:

source: Committer:
ta: ஆணையர்:

source: Original File:
ta: அசல் கோப்பு:

source: Cannot find HEAD commit:
ta: தலை உறுதிப்பாட்டைக் கண்டுபிடிக்க முடியவில்லை:

source: Cannot find parent commit:
ta: பெற்றோர் உறுதிப்பாட்டைக் கண்டுபிடிக்க முடியவில்லை:

source: Unable to display parent
ta: பெற்றோரைக் காட்ட முடியவில்லை

source: Error loading diff:
ta: பிழை ஏற்றுதல் வேறுபாடு:

source: Originally By:
ta: முதலில்:

source: In File:
ta: கோப்பில்:

source: Copied Or Moved Here By:
ta: இங்கு நகலெடுக்கப்பட்டது அல்லது நகர்த்தப்பட்டது:

source: No differences detected. %s has no changes. The modification date of this file was updated by another application, but the content within the file was not changed. A rescan will be automatically started to find other files which may have the same state.
ta: வேறுபாடுகள் எதுவும் கண்டறியப்படவில்லை. %s எந்த மாற்றங்களும் இல்லை. இந்த கோப்பின் மாற்றும் தேதி மற்றொரு பயன்பாட்டால் புதுப்பிக்கப்பட்டது, ஆனால் கோப்பில் உள்ள உள்ளடக்கம் மாற்றப்படவில்லை. அதே நிலையைக் கொண்ட பிற கோப்புகளைக் கண்டுபிடிக்க ஒரு மீட்டமைப்பை தானாகத் தொடங்கும்.

source: Loading diff of %s...
ta: %s இன் வேறுபாட்டை ஏற்றுகிறது ...

source: LOCAL: deleted REMOTE:
ta: உள்ளூர்: நீக்கப்பட்டது தொலைநிலை:

source: REMOTE: deleted LOCAL:
ta: தொலைநிலை: நீக்கப்பட்டது உள்ளூர்:

source: LOCAL:
ta: உள்ளூர்:

source: REMOTE:
ta: தொலைநிலை:

source: Unable to display %s
ta: %s ஐக் காட்ட முடியவில்லை

source: Error loading file:
ta: கோப்பை ஏற்றுவதில் பிழை:

source: Git Repository (subproject)
ta: அறிவிலி களஞ்சியம் (துணை திட்டம்)

source: * Binary file (not showing content).
ta: * பைனரி கோப்பு (உள்ளடக்கத்தைக் காட்டவில்லை).

source: * Untracked file is %d bytes. * Showing only first %d bytes.
ta: * கட்டுப்படுத்தப்படாத கோப்பு %d பைட்டுகள். * முதல் %d பைட்டுகளை மட்டுமே காட்டுகிறது.

source: * Untracked file clipped here by %s. * To see the entire file, use an external editor.
ta: * கட்டுப்படுத்தப்படாத கோப்பு இங்கே %s ஆல் கிளிப் செய்யப்பட்டது. * முழு கோப்பையும் காண, வெளிப்புற எடிட்டரைப் பயன்படுத்தவும்.

source: Failed to unstage selected hunk.
ta: தேர்ந்தெடுக்கப்பட்ட அங்க் இடைக்குத் தவறிவிட்டது.

source: Failed to revert selected hunk.
ta: தேர்ந்தெடுக்கப்பட்ட அங்கை மாற்றுவதில் தோல்வி.

source: Failed to stage selected hunk.
ta: தேர்ந்தெடுக்கப்பட்ட அங்கை மேடை செய்யத் தவறிவிட்டது.

source: Failed to unstage selected line.
ta: தேர்ந்தெடுக்கப்பட்ட வரியில் கட்டமைக்கத் தவறிவிட்டது.

source: Failed to revert selected line.
ta: தேர்ந்தெடுக்கப்பட்ட வரியை மாற்றுவதில் தோல்வி.

source: Failed to stage selected line.
ta: தேர்ந்தெடுக்கப்பட்ட வரியை நிலைநிறுத்துவதில் தோல்வி.

source: Failed to undo last revert.
ta: கடைசியாக மாற்றியமைக்கத் தவறிவிட்டது.

source: No keys found.
ta: விசைகள் எதுவும் கிடைக்கவில்லை.

source: Found a public key in: %s
ta: இதில் ஒரு பொது விசை கிடைத்தது: %s

source: Generate Key
ta: விசையை உருவாக்குங்கள்

source: Copy To Clipboard
ta: இடைநிலைப்பலகைக்கு நகலெடுக்கவும்

source: Your OpenSSH Public Key
ta: உங்கள் ஓபன்ச் பொது விசை

source: Generating...
ta: உருவாக்குதல் ...

source: Could not start ssh-keygen: %s
ta: SSH-KEYGEN ஐத் தொடங்க முடியவில்லை: %s

source: Generation failed.
ta: தலைமுறை தோல்வியடைந்தது.

source: Generation succeeded, but no keys found.
ta: தலைமுறை செய் பெற்றது, ஆனால் விசைகள் எதுவும் கிடைக்கவில்லை.

source: Your key is in: %s
ta: உங்கள் திறவுகோல் உள்ளது: %s

source: %s (%s): Create Branch
ta: %s (%s): கிளையை உருவாக்கவும்

source: Create New Branch
ta: புதிய கிளையை உருவாக்கவும்

source: Branch Name
ta: கிளை பெயர்

source: Match Tracking Branch Name
ta: போட்டி கண்காணிப்பு கிளை பெயர்

source: Starting Revision
ta: தொடங்கும் திருத்தம்

source: Update Existing Branch:
ta: தற்போதுள்ள கிளைப் புதுப்பிக்கவும்:

source: No
ta: இல்லை

source: Fast Forward Only
ta: வேகமாக முன்னோக்கி மட்டுமே

source: Checkout After Creation
ta: படைப்புக்குப் பிறகு புதுப்பிக்கவும்

source: Please select a tracking branch.
ta: கண்காணிப்பு கிளையைத் தேர்ந்தெடுக்கவும்.

source: Tracking branch %s is not a branch in the remote repository.
ta: கிளை %s கண்காணிப்பு தொலை களஞ்சியத்தில் ஒரு கிளை அல்ல.

source: Working... please wait...
ta: வேலை ... தயவுசெய்து காத்திருங்கள் ...

source: Success
ta: செய்

source: Error: Command Failed
ta: பிழை: கட்டளை தோல்வியடைந்தது

source: Goto Line:
ta: கோட்டோ வரி:

source: Go
ta: போ

source: This Detached Checkout
ta: இந்த பிரிக்கப்பட்ட புதுப்பிப்பு

source: Revision Expression:
ta: திருத்த வெளிப்பாடு:

source: Local Branch
ta: உள்ளக கிளை

source: Tracking Branch
ta: கண்காணிப்பு கிளை

source: Tag
ta: குறிச்சொல்

source: Invalid revision: %s
ta: தவறான திருத்தம்: %s

source: No revision selected.
ta: திருத்தம் எதுவும் தேர்ந்தெடுக்கப்படவில்லை.

source: Revision expression is empty.
ta: திருத்த வெளிப்பாடு காலியாக உள்ளது.

source: Updated
ta: புதுப்பிக்கப்பட்டது

source: URL
ta: முகவரி

source: There is nothing to amend. You are about to create the initial commit. There is no commit before this to amend.
ta: திருத்த எதுவும் இல்லை. நீங்கள் ஆரம்ப உறுதிப்பாட்டை உருவாக்க உள்ளீர்கள். இதைத் திருத்துவதற்கு முன்பு எந்த உறுதிப்பாடும் இல்லை.

source: Cannot amend while merging. You are currently in the middle of a merge that has not been fully completed. You cannot amend the prior commit unless you first abort the current merge activity.
ta: ஒன்றிணைக்கும் போது திருத்த முடியாது. நீங்கள் தற்போது முழுமையாக முடிக்கப்படாத ஒரு ஒன்றிணைப்பின் நடுவில் இருக்கிறீர்கள். தற்போதைய ஒன்றிணைக்கும் செயல்பாட்டை நீங்கள் முதலில் நிறுத்தாவிட்டால் முந்தைய உறுதிப்பாட்டை நீங்கள் திருத்த முடியாது.

source: Error loading commit data for amend:
ta: திருத்தத்திற்கான தரவை ஏற்றுதல் திருத்தத்திற்கான தரவை ஏற்றுவது:

source: Unable to obtain your identity:
ta: உங்கள் அடையாளத்தைப் பெற முடியவில்லை:

source: Invalid GIT_COMMITTER_IDENT:
ta: தவறான git_committer_ident:

source: warning: Tcl does not support encoding '%s'.
ta: எச்சரிக்கை: '%s' குறியாக்கத்தை டி.சி.எல் ஆதரிக்கவில்லை.

source: Last scanned state does not match repository state. Another Git program has modified this repository since the last scan. A rescan must be performed before another commit can be created. The rescan will be automatically started now.
ta: கடைசியாக வருடு செய்யப்பட்ட மாநிலம் களஞ்சிய நிலைக்கு பொருந்தவில்லை. மற்றொரு சிஐடி திட்டம் கடைசி வருடு முதல் இந்த களஞ்சியத்தை மாற்றியமைத்துள்ளது. மற்றொரு உறுதிப்பாட்டை உருவாக்குவதற்கு முன்பு ஒரு மீட்டமைப்பை செய்ய வேண்டும். ரெச்கான் இப்போது தானாகவே தொடங்கப்படும்.

source: Unmerged files cannot be committed. File %s has merge conflicts. You must resolve them and stage the file before committing.
ta: அவிழ்க்கப்படாத கோப்புகளை செய்ய முடியாது. கோப்பு %s ஒன்றிணைக்கும் மோதல்களைக் கொண்டுள்ளன. நீங்கள் அவற்றைத் தீர்த்துக் கொள்ள வேண்டும்.

source: Unknown file state %s detected. File %s cannot be committed by this program.
ta: அறியப்படாத கோப்பு நிலை %s கண்டறியப்பட்டன. இந்த திட்டத்தால் %s செய்ய முடியாது.

source: No changes to commit. You must stage at least 1 file before you can commit.
ta: செய்ய எந்த மாற்றங்களும் இல்லை. நீங்கள் ஈடுபடுவதற்கு முன்பு நீங்கள் குறைந்தது 1 கோப்பை அரங்கேற்ற வேண்டும்.

source: Please supply a commit message. A good commit message has the following format: - First line: Describe in one sentence what you did. - Second line: Blank - Remaining lines: Describe why this change is good.
ta: தயவுசெய்து ஒரு கமிட் செய்தியை வழங்கவும். ஒரு நல்ல கமிட் செய்தி பின்வரும் வடிவத்தைக் கொண்டுள்ளது: - முதல் வரி: நீங்கள் செய்ததை ஒரு வாக்கியத்தில் விவரிக்கவும். - இரண்டாவது வரி: வெற்று - மீதமுள்ள கோடுகள்: இந்த மாற்றம் ஏன் நல்லது என்பதை விவரிக்கவும்.

source: Calling pre-commit hook...
ta: முன் கட்டளை கொக்கி என்று அழைக்கிறது ...

source: Commit declined by pre-commit hook.
ta: கமிட்-கமிட் ஊக்கால் மறுக்கப்பட்டது.

source: You are about to commit on a detached head. This is a potentially dangerous thing to do because if you switch to another branch you will lose your changes and it can be difficult to retrieve them later from the reflog. You should probably cancel this commit and create a new branch to continue. Do you really want to proceed with your Commit?
ta: நீங்கள் பிரிக்கப்பட்ட தலையில் ஈடுபட உள்ளீர்கள். இது ஒரு ஆபத்தான சேதி, ஏனென்றால் நீங்கள் வேறொரு கிளைக்கு மாறினால் உங்கள் மாற்றங்களை இழப்பீர்கள், பின்னர் அவற்றை பிரதிபலிப்பிலிருந்து மீட்டெடுப்பது கடினம். நீங்கள் இந்த உறுதிப்பாட்டை ரத்துசெய்து தொடர ஒரு புதிய கிளையை உருவாக்க வேண்டும். உங்கள் உறுதிப்பாட்டைத் தொடர விரும்புகிறீர்களா?

source: Calling commit-msg hook...
ta: கமிட்-எம்.எச்.சி ஊக்கை அழைக்கிறது ...

source: Commit declined by commit-msg hook.
ta: கமிட்-எம்.எச்.சி ஊக்கால் கமிட் மறுக்கப்பட்டது.

source: Committing changes...
ta: மாற்றங்களைச் செய்கிறது ...

source: write-tree failed:
ta: எழுதும் மரம் தோல்வியுற்றது:

source: Commit failed.
ta: கமிட் தோல்வியுற்றது.

source: Commit %s appears to be corrupt
ta: கமிட் %s ஊழல் நிறைந்ததாகத் தெரிகிறது

source: No changes to commit. No files were modified by this commit and it was not a merge commit. A rescan will be automatically started now.
ta: செய்ய எந்த மாற்றங்களும் இல்லை. இந்த உறுதிப்பாட்டால் எந்த கோப்புகளும் மாற்றியமைக்கப்படவில்லை, இது ஒரு ஒன்றிணைந்த உறுதிப்பாடு அல்ல. ஒரு மீட்டமை இப்போது தானாகவே தொடங்கப்படும்.

source: No changes to commit.
ta: செய்ய எந்த மாற்றங்களும் இல்லை.

source: commit-tree failed:
ta: கமிட்-மரம் தோல்வியுற்றது:

source: update-ref failed:
ta: புதுப்பிப்பு-ரெஃப் தோல்வியுற்றது:

source: Created commit %s: %s
ta: உருவாக்கப்பட்ட கமிட் %s: %s

source: %s (%s): Delete Branch
ta: %s (%s): கிளையை நீக்கு

source: Delete Local Branch
ta: உள்ளக கிளையை நீக்கு

source: Local Branches
ta: உள்ளக கிளைகள்

source: Delete Only If Merged Into
ta: ஒன்றிணைந்தால் மட்டுமே நீக்கவும்

source: The following branches are not completely merged into %s:
ta: பின்வரும் கிளைகள் %s இல் முழுமையாக இணைக்கப்படவில்லை:

source: Failed to delete branches: %s
ta: கிளைகளை நீக்குவதில் தோல்வி: %s

source: Invalid date from Git: %s
ta: GIT இலிருந்து தவறான தேதி: %s

source: Number of loose objects
ta: தளர்வான பொருட்களின் எண்ணிக்கை

source: Disk space used by loose objects
ta: தளர்வான பொருள்களால் பயன்படுத்தப்படும் வட்டு இடம்

source: Number of packed objects
ta: நிரம்பிய பொருட்களின் எண்ணிக்கை

source: Number of packs
ta: பொதிகளின் எண்ணிக்கை

source: Disk space used by packed objects
ta: நிரம்பிய பொருள்களால் பயன்படுத்தப்படும் வட்டு இடம்

source: Packed objects waiting for pruning
ta: கத்தரிக்காய் காத்திருக்கும் நிரம்பிய பொருள்கள்

source: Garbage files
ta: குப்பை கோப்புகள்

source: %s (%s): Database Statistics
ta: %s (%s): தரவுத்தள புள்ளிவிவரங்கள்

source: Compressing the object database
ta: பொருள் தரவுத்தளத்தை சுருக்கவும்

source: Verifying the object database with fsck-objects
ta: பொருள் தரவுத்தளத்தை FSCK-Objects உடன் சரிபார்க்கவும்

source: This repository currently has approximately %i loose objects. To maintain optimal performance it is strongly recommended that you compress the database. Compress the database now?
ta: இந்த களஞ்சியத்தில் தற்போது சுமார் %நான் தளர்வான பொருள்களைக் கொண்டுள்ளது. உகந்த செயல்திறனை பராமரிக்க நீங்கள் தரவுத்தளத்தை சுருக்க வேண்டும் என்று கடுமையாக பரிந்துரைக்கப்படுகிறது. இப்போது தரவுத்தளத்தை சுருக்கவா?

source: %s: error
ta: %s: பிழை

source: %s: warning
ta: %s: முன்னறிவிப்பு

source: %s hook failed:
ta: %s ஊக் தோல்வியுற்றது:

source: You must correct the above errors before committing.
ta: செய்வதற்கு முன் மேலே உள்ள பிழைகளை நீங்கள் சரிசெய்ய வேண்டும்.

source: %s (%s): error
ta: %s (%s): பிழை

source: Cannot merge while amending. You must finish amending this commit before starting any type of merge.
ta: திருத்தும்போது ஒன்றிணைக்க முடியாது. எந்தவொரு ஒன்றிணைப்பையும் தொடங்குவதற்கு முன் இந்த உறுதிப்பாட்டை திருத்துவதை நீங்கள் முடிக்க வேண்டும்.

source: Last scanned state does not match repository state. Another Git program has modified this repository since the last scan. A rescan must be performed before a merge can be performed. The rescan will be automatically started now.
ta: கடைசியாக வருடு செய்யப்பட்ட மாநிலம் களஞ்சிய நிலைக்கு பொருந்தவில்லை. மற்றொரு சிஐடி திட்டம் கடைசி வருடு முதல் இந்த களஞ்சியத்தை மாற்றியமைத்துள்ளது. ஒன்றிணைக்கப்படுவதற்கு முன்பு ஒரு மீட்டமைப்பை செய்ய வேண்டும். ரெச்கான் இப்போது தானாகவே தொடங்கப்படும்.

source: You are in the middle of a conflicted merge. File %s has merge conflicts. You must resolve them, stage the file, and commit to complete the current merge. Only then can you begin another merge.
ta: நீங்கள் ஒரு முரண்பட்ட ஒன்றிணைப்பின் நடுவில் இருக்கிறீர்கள். கோப்பு %s ஒன்றிணைக்கும் மோதல்களைக் கொண்டுள்ளன. நீங்கள் அவற்றைத் தீர்க்க வேண்டும், கோப்பை அரங்கேற்ற வேண்டும், தற்போதைய ஒன்றிணையை முடிக்க உறுதியளிக்க வேண்டும். அப்போதுதான் நீங்கள் மற்றொரு ஒன்றிணைந்து தொடங்க முடியும்.

source: You are in the middle of a change. File %s is modified. You should complete the current commit before starting a merge. Doing so will help you abort a failed merge, should the need arise.
ta: நீங்கள் ஒரு மாற்றத்தின் நடுவில் இருக்கிறீர்கள். கோப்பு %s மாற்றியமைக்கப்படுகின்றன. ஒன்றிணைக்கத் தொடங்குவதற்கு முன் தற்போதைய உறுதிப்பாட்டை நீங்கள் முடிக்க வேண்டும். அவ்வாறு செய்வது தோல்வியுற்ற ஒன்றிணைப்பைக் கைவிட உதவும், தேவை ஏற்பட்டால்.

source: %s of %s
ta: %s %s

source: Merging %s and %s...
ta: %s மற்றும் %s ஐ இணைத்தல் ...

source: Merge completed successfully.
ta: ஒன்றிணைந்தது வெற்றிகரமாக முடிந்தது.

source: Merge failed. Conflict resolution is required.
ta: ஒன்றிணைந்தது தோல்வியுற்றது. மோதல் தீர்வு தேவை.

source: %s (%s): Merge
ta: %s (%s): ஒன்றிணைக்கவும்

source: Merge Into %s
ta: %s ஆக இணைக்கவும்

source: Revision To Merge
ta: ஒன்றிணைக்க திருத்தம்

source: Cannot abort while amending. You must finish amending this commit.
ta: திருத்தும்போது கருக்கலைப்பு செய்ய முடியாது. இந்த உறுதிப்பாட்டை திருத்துவதை நீங்கள் முடிக்க வேண்டும்.

source: Abort merge? Aborting the current merge will cause *ALL* uncommitted changes to be lost. Continue with aborting the current merge?
ta: ஒன்றிணைக்கவா? தற்போதைய ஒன்றிணைப்பைக் கருக்கலைப்பது * அனைத்து * மாற்றப்படாத மாற்றங்களையும் இழக்கச் செய்யும். தற்போதைய ஒன்றிணைப்பைக் கருக்கலைப்பதைத் தொடரவா?

source: Reset changes? Resetting the changes will cause *ALL* uncommitted changes to be lost. Continue with resetting the current changes?
ta: மாற்றங்களை மீட்டமைக்கவா? மாற்றங்களை மீட்டமைப்பது * அனைத்து * மாற்றப்படாத மாற்றங்களையும் இழக்கச் செய்யும். தற்போதைய மாற்றங்களை மீட்டமைப்பதில் தொடரவா?

source: Aborting
ta: கருக்கலைப்பு

source: files reset
ta: கோப்புகள் மீட்டமைக்கப்படுகின்றன

source: Abort failed.
ta: கருக்கலைப்பு தோல்வியுற்றது.

source: Abort completed. Ready.
ta: கருக்கலைப்பு முடிந்தது. ஆயத்தம்.
