Repository: Nizhal/git-gui
Catalog: po/*.po
Languages: ta

source: Invalid font specified in %s:
ta: %s இல் குறிப்பிடப்பட்டுள்ள தவறான எழுத்துரு:

source: Main Font
ta: முதன்மையான எழுத்துரு

source: Diff/Console Font
ta: வேறுபாடு/கன்சோல் எழுத்துரு

source: git-gui: fatal error
ta: Git-gui: அபாயகரமான பிழை

source: Cannot find git in PATH.
ta: பாதையில் அறிவிலி கண்டுபிடிக்க முடியவில்லை.

source: Cannot parse Git version string:
ta: அறிவிலி பதிப்பு சரத்தை அலச முடியாது:

source: Git version cannot be determined. %s claims it is version '%s'. %s requires at least Git 1.5.0 or later. Assume '%s' is version 1.5.0?
ta: அறிவிலி பதிப்பை தீர்மானிக்க முடியாது. இது பதிப்பு '%s' என்று%s கூறுகிறது. %s க்கு குறைந்தது GIT 1.5.0 அல்லது அதற்குப் பிறகு தேவைப்படுகிறது. '%s' என்பது பதிப்பு 1.5.0 என்று வைத்துக் கொள்ளுங்கள்?

source: Git directory not found:
ta: அறிவிலி அடைவு காணப்படவில்லை:

source: Cannot move to top of working directory:
ta: வேலை கோப்பகத்தின் உச்சிக்கு செல்ல முடியாது:

source: Cannot use bare repository:
ta: வெற்று களஞ்சியத்தைப் பயன்படுத்த முடியாது:

source: No working directory
ta: வேலை அடைவு இல்லை

source: Refreshing file status...
ta: புத்துணர்ச்சியூட்டும் கோப்பு நிலை ...

source: Scanning for modified files ...
ta: மாற்றியமைக்கப்பட்ட கோப்புகளுக்கு ச்கேனிங் ...

source: Calling prepare-commit-msg hook...
ta: Preper-commit-msg ஊக்கை அழைக்கிறது ...

source: Commit declined by prepare-commit-msg hook.
ta: தயாரிப்பு-கமிட்-எம்.எச்.சி ஊக் மூலம் கமிட் குறைக்கப்பட்டுள்ளது.

source: Ready.
ta: ஆயத்தம்.

source: Display limit (gui.maxfilesdisplayed = %s) reached, not showing all %s files.
ta: காட்சி வரம்பு (gui.maxfilesdisplayed = %s) எட்டியது, அனைத்து %s கோப்புகளையும் காட்டவில்லை.

source: Unmodified
ta: மாற்றப்படாதது

source: Modified, not staged
ta: மாற்றியமைக்கப்பட்ட, அரங்கேற்றப்படவில்லை

source: Staged for commit
ta: உறுதிப்பாட்டிற்காக அரங்கேற்றப்பட்டது

source: Portions staged for commit
ta: உறுதிப்பாட்டிற்காக அரங்கேற்றப்பட்ட பகுதிகள்

source: Staged for commit, missing
ta: உறுதிப்பாட்டிற்காக அரங்கேற்றப்பட்டது, காணவில்லை

source: File type changed, not staged
ta: கோப்பு வகை மாற்றப்பட்டது, அரங்கேற்றப்படவில்லை

source: File type changed, old type staged for commit
ta: கோப்பு வகை மாற்றப்பட்டது, பழைய வகை கமிட்டத்திற்காக அரங்கேற்றப்பட்டது

source: File type changed, staged
ta: கோப்பு வகை மாற்றப்பட்டது, அரங்கேற்றப்பட்டது

source: File type change staged, modification not staged
ta: கோப்பு வகை மாற்றம் அரங்கேற்றப்பட்டது, மாற்றம் அரங்கேற்றப்படவில்லை

source: File type change staged, file missing
ta: கோப்பு வகை மாற்றம் அரங்கேற்றப்பட்டது, கோப்பு இல்லை

source: Untracked, not staged
ta: கட்டுப்படுத்தப்படாதது, அரங்கேற்றப்படவில்லை

source: Missing
ta: இல்லை

source: Staged for removal
ta: அகற்றுவதற்காக அரங்கேற்றப்பட்டது

source: Staged for removal, still present
ta: அகற்றுவதற்காக அரங்கேற்றப்பட்டது, இன்னும் உள்ளது

source: Requires merge resolution
ta: ஒன்றிணைக்கும் தீர்மானம் தேவை

source: Couldn't find gitk in PATH
ta: பாதையில் கிட்கைக் கண்டுபிடிக்க முடியவில்லை

source: Starting %s... please wait...
ta: %s தொடங்குகின்றன ... தயவுசெய்து காத்திருங்கள் ...

source: Couldn't find git gui in PATH
ta: பாதையில் அறிவிலி குயியைக் கண்டுபிடிக்க முடியவில்லை

source: Repository
ta: களஞ்சியம்

source: Edit
ta: தொகு

source: Branch
ta: கிளை

source: Commit@@noun
ta: @@ பெயர்ச்சொல்

source: Merge
ta: ஒன்றிணைக்கவும்

source: Remote
ta: தொலைநிலை

source: Tools
ta: கருவிகள்

source: Explore Working Copy
ta: வேலை நகலை ஆராயுங்கள்

source: Git Bash
ta: அறிவிலி பாச்

source: Browse Current Branch's Files
ta: தற்போதைய கிளையின் கோப்புகளை உலாவுக

source: Browse Branch Files...
ta: கிளை கோப்புகளை உலாவுக ...

source: Visualize Current Branch's History
ta: தற்போதைய கிளையின் வரலாற்றைக் காட்சிப்படுத்துங்கள்

source: Visualize All Branch History
ta: அனைத்து கிளை வரலாற்றையும் காட்சிப்படுத்துங்கள்

source: Browse %s's Files
ta: %s இன் கோப்புகளை உலாவுக

source: Visualize %s's History
ta: %s இன் வரலாற்றைக் காட்சிப்படுத்துங்கள்

source: Database Statistics
ta: தரவுத்தள புள்ளிவிவரங்கள்

source: Compress Database
ta: தரவுத்தளத்தை சுருக்கவும்

source: Verify Database
ta: தரவுத்தளத்தை சரிபார்க்கவும்

source: Create Desktop Icon
ta: டெச்க்டாப் ஐகானை உருவாக்கவும்

source: Quit
ta: வெளியேறு

source: Undo
ta: செயல்தவிர்

source: Redo
ta: மீண்டும்செய்

source: Cut
ta: வெட்டு

source: Copy
ta: நகலெடு

source: Paste
ta: ஒட்டு

source: Delete
ta: நீக்கு

source: Select All
ta: அனைத்தையும் தெரிவுசெய்

source: Create...
ta: உருவாக்கு ...

source: Checkout...
ta: புதுப்பித்து ...

source: Rename...
ta: மறுபெயரிடுங்கள் ...

source: Delete...
ta: நீக்கு ...

source: Reset...
ta: மீட்டமை ...

source: Done
ta: முடிந்தது

source: Commit@@verb
ta: @@ வினைச்சொல்

source: Amend Last Commit
ta: கடைசி உறுதிப்பாட்டை திருத்துங்கள்

source: Rescan
ta: ரெச்கான்

source: Stage To Commit
ta: செய்ய மேடை

source: Stage Changed Files To Commit
ta: மேடை மாற்றப்பட்ட கோப்புகள்

source: Unstage From Commit
ta: கமிட்டிலிருந்து கட்டமாக

source: Revert Changes
ta: மாற்றங்களை மாற்றியமைத்தல்

source: Show Less Context
ta: குறைவான சூழலைக் காட்டுங்கள்

source: Show More Context
ta: மேலும் சூழலைக் காட்டு

source: Sign Off
ta: பதிவு செய்க

source: Local Merge...
ta: உள்ளக ஒன்றிணைப்பு ...

source: Abort Merge...
ta: ஒன்றிணைத்தல் ...

source: Add...
ta: சேர்க்கவும் ...

source: Push...
ta: புச் ...

source: Delete Branch...
ta: கிளையை நீக்கு ...

source: Options...
ta: விருப்பங்கள் ...

source: Remove...
ta: அகற்று ...

source: Help
ta: உதவி

source: About %s
ta: சுமார் %s

source: Online Documentation
ta: நிகழ்நிலை ஆவணங்கள்

source: Show SSH Key
ta: பாஓடு விசையை காட்டு

source: usage:
ta: பயன்பாடு:

source: Usage
ta: பயன்பாடு

source: Error
ta: பிழை

source: fatal: cannot stat path %s: No such file or directory
ta: அபாயகரமானது: ச்டேட் பாதை %s: அத்தகைய கோப்பு அல்லது அடைவு இல்லை

source: Current Branch:
ta: தற்போதைய கிளை:

source: Unstaged Changes
ta: நிலையற்ற மாற்றங்கள்

source: Staged Changes (Will Commit)
ta: அரங்கேற்றப்பட்ட மாற்றங்கள் (செய்யும்)

source: Stage Changed
ta: மேடை மாற்றப்பட்டது

source: Push
ta: புச்

source: Initial Commit Message:
ta: ஆரம்ப கமிட் செய்தி:

source: Amended Commit Message:
ta: திருத்தப்பட்ட செய்த செய்தி:

source: Amended Initial Commit Message:
ta: திருத்த ஆரம்ப கமிட் செய்தி:

source: Amended Merge Commit Message:
ta: திருத்தப்பட்ட ஒன்றிணைப்பு செய்தியை ஒன்றிணைத்தல்:

source: Merge Commit Message:
ta: செய்தியை ஒன்றிணைக்கவும்:

source: Commit Message:
ta: செய்தியைச் செய்யுங்கள்:

source: Copy All
ta: அனைத்தையும் நகலெடுக்கவும்

source: File:
ta: கோப்பு:

source: Open
ta: திற

source: Refresh
ta: புதுப்பிப்பு

source: Decrease Font Size
ta: எழுத்துரு அளவைக் குறைக்கவும்

source: Increase Font Size
ta: எழுத்துரு அளவை அதிகரிக்கவும்

source: Encoding
ta: குறியாக்கம்

source: Apply/Reverse Hunk
ta: விண்ணப்பிக்கவும்/தலைகீழ் அங்க்

source: Apply/Reverse Line
ta: விண்ணப்பிக்கவும்/தலைகீழ் வரி

source: Revert Hunk
ta: அங்க் மாற்றவும்

source: Revert Line
ta: வரி மாற்றவும்

source: Undo Last Revert
ta: கடைசியாக மாற்றியமைக்கவும்

source: Run Merge Tool
ta: ஒன்றிணைக்கும் கருவியை இயக்கவும்

source: Use Remote Version
ta: தொலை பதிப்பைப் பயன்படுத்தவும்

source: Use Local Version
ta: உள்ளக பதிப்பைப் பயன்படுத்தவும்

source: Revert To Base
ta: தளத்திற்கு திரும்பவும்

source: Visualize These Changes In The Submodule
ta: துணைமோடூலில் இந்த மாற்றங்களைக் காட்சிப்படுத்துங்கள்

source: Visualize Current Branch History In The Submodule
ta: துணைமோடூலில் தற்போதைய கிளை வரலாற்றைக் காட்சிப்படுத்துங்கள்

source: Visualize All Branch History In The Submodule
ta: சப்மோடூலில் அனைத்து கிளை வரலாற்றையும் காட்சிப்படுத்துங்கள்

source: Start git gui In The Submodule
ta: சப்மோடூலில் அறிவிலி குய் தொடங்கவும்

source: Unstage Hunk From Commit
ta: கமிட்டிலிருந்து இடமாக அங்க்

source: Unstage Lines From Commit
ta: கமிட்டிலிருந்து கட்டப்பட்ட கோடுகள்

source: Revert Lines
ta: கோடுகளை மாற்றவும்

source: Unstage Line From Commit
ta: கமிட்டிலிருந்து கட்டம் வரி

source: Stage Hunk For Commit
ta: கமிட்டத்திற்காக மேடை அங்க்

source: Stage Lines For Commit
ta: உறுதிப்பாட்டிற்கான மேடை கோடுகள்

source: Stage Line For Commit
ta: உறுதிப்பாட்டிற்கான மேடை வரி

source: Initializing...
ta: தொடங்குதல் ...

source: Possible environment issues exist. The following environment variables are probably going to be ignored by any Git subprocess run by %s:
ta: சாத்தியமான சூழல் சிக்கல்கள் உள்ளன. பின்வரும் சுற்றுச்சூழல் மாறிகள் அநேகமாக இருக்கலாம் எந்தவொரு அறிவிலி துணை செயலாக்கமும் புறக்கணிக்கப்படப் போகிறது மூலம் %s:

source: This is due to a known issue with the Tcl binary distributed by Cygwin.
ta: இது அறியப்பட்ட சிக்கல் காரணமாகும் சைக்வின் விநியோகித்த டி.சி.எல் பைனரி.

source: A good replacement for %s is placing values for the user.name and user.email settings into your personal ~/.gitconfig file.
ta: %s க்கு ஒரு நல்ல மாற்று பயனருக்கான மதிப்புகளை வைக்கிறது. பெயர் மற்றும் உங்கள் தனிப்பட்ட அமைப்புகளில் பயனர் ~/.gitconfig கோப்பு.

source: Unsupported spell checker
ta: ஆதரிக்கப்படாத எழுத்துப்பிழை சரிபார்ப்பு

source: Spell checking is unavailable
ta: எழுத்துப்பிழை சோதனை கிடைக்கவில்லை

source: Invalid spell checking configuration
ta: தவறான எழுத்துப்பிழை சரிபார்ப்பு உள்ளமைவு

source: Reverting dictionary to %s.
ta: அகராதியை %s ஆக மாற்றுகிறது.

source: Spell checker silently failed on startup
ta: தொடக்கத்தில் எழுத்துப்பிழை சரிபார்ப்பு அமைதியாக தோல்வியடைந்தது

source: Unrecognized spell checker
ta: அங்கீகரிக்கப்படாத எழுத்துப்பிழை சரிபார்ப்பு

source: No Suggestions
ta: பரிந்துரைகள் இல்லை

source: Unexpected EOF from spell checker
ta: எழுத்துப்பிழை சரிபார்ப்பிலிருந்து எதிர்பாராத EOF

source: Spell Checker Failed
ta: எழுத்துப்பிழை சரிபார்ப்பு தோல்வியடைந்தது

source: fetch %s
ta: %s பெறவும்

source: Fetching new changes from %s
ta: %s இலிருந்து புதிய மாற்றங்களைப் பெறுகிறது

source: remote prune %s
ta: தொலைநிலை ப்ரூன் %s

source: Pruning tracking branches deleted from %s
ta: கத்தரிக்காய் கண்காணிப்பு கிளைகள் %s இலிருந்து நீக்கப்பட்டன

source: fetch all remotes
ta: அனைத்து தொலைதூரங்களையும் பெறுங்கள்

source: Fetching new changes from all remotes
ta: அனைத்து ரிமோட்டுகளிலிருந்தும் புதிய மாற்றங்களைப் பெறுகிறது

source: remote prune all remotes
ta: ரிமோட் ப்ரூன் அனைத்து ரிமோட்டுகளும்

source: Pruning tracking branches deleted from all remotes
ta: கத்தரிக்காய் கண்காணிப்பு கிளைகள் அனைத்து தொலைதூரங்களிலிருந்தும் நீக்கப்பட்டன

source: push %s
ta: புச் %s

source: Pushing changes to %s
ta: மாற்றங்களை %s க்கு தள்ளுகிறது

source: Mirroring to %s
ta: %s க்கு பிரதிபலிக்கிறது

source: Pushing %s %s to %s
ta: %s %s க்கு %s க்கு தள்ளுகிறது

source: Push Branches
ta: புச் கிளைகள்

source: Cancel
ta: ரத்துசெய்

source: Source Branches
ta: மூல கிளைகள்

source: Destination Repository
ta: இலக்கு களஞ்சியம்

source: Remote:
ta: தொலைநிலை:

source: Arbitrary Location:
ta: தன்னிச்சையான இடம்:

source: Transfer Options
ta: பரிமாற்ற விருப்பங்கள்

source: Force overwrite existing branch (may discard changes)
ta: ஏற்கனவே இருக்கும் கிளையை மேலெழுதும் (மாற்றங்களை நிராகரிக்கலாம்)

source: Use thin pack (for slow network connections)
ta: மெல்லிய பேக் பயன்படுத்தவும் (மெதுவான பிணைய இணைப்புகளுக்கு)

source: Include tags
ta: குறிச்சொற்களைச் சேர்க்கவும்

source: %s (%s): Push
ta: %s (%s): புச்

source: Fetching %s from %s
ta: %s இலிருந்து %s ஐப் பெறுதல்

source: fatal: Cannot resolve %s
ta: அபாயகரமானது: %s ஐ தீர்க்க முடியாது

source: Close
ta: மூடு

source: Branch '%s' does not exist.
ta: கிளை '%s' இல்லை.

source: Failed to configure simplified git-pull for '%s'.
ta: '%s' க்கு எளிமைப்படுத்தப்பட்ட கிட்-புல்லை உள்ளமைக்கத் தவறிவிட்டது.

source: Branch '%s' already exists.
ta: கிளை '%s' ஏற்கனவே உள்ளது.

source: Branch '%s' already exists. It cannot fast-forward to %s. A merge is required.
ta: கிளை '%s' ஏற்கனவே உள்ளது. இது %s க்கு வேகமாக முன்னோக்கி செல்ல முடியாது. ஒன்றிணைப்பு தேவை.

source: Merge strategy '%s' not supported.
ta: மூலோபாயத்தை ஒன்றிணைக்கவில்லை '%s' ஆதரிக்கப்படவில்லை.

source: Failed to update '%s'.
ta: '%s' புதுப்பிக்கத் தவறிவிட்டது.

source: Staging area (index) is already locked.
ta: ச்டேசிங் பகுதி (குறியீட்டு) ஏற்கனவே பூட்டப்பட்டுள்ளது.

source: Last scanned state does not match repository state. Another Git program has modified this repository since the last scan. A rescan must be performed before the current branch can be changed. The rescan will be automatically started now.
ta: கடைசியாக வருடு செய்யப்பட்ட மாநிலம் களஞ்சிய நிலைக்கு பொருந்தவில்லை. மற்றொரு சிஐடி திட்டம் கடைசி வருடு முதல் இந்த களஞ்சியத்தை மாற்றியமைத்துள்ளது. தற்போதைய கிளையை மாற்றுவதற்கு முன்பு ஒரு மீட்டமைப்பை செய்ய வேண்டும். ரெச்கான் இப்போது தானாகவே தொடங்கப்படும்.

source: Updating working directory to '%s'...
ta: பணி கோப்பகத்தை '%s' க்கு புதுப்பித்தல் ...

source: files checked out
ta: கோப்புகள் சரிபார்க்கப்பட்டன

source: Aborted checkout of '%s' (file level merging is required).
ta: '%s' (கோப்பு நிலை இணைத்தல் தேவை) இன் கைவிடப்பட்ட புதுப்பிப்பு.

source: File level merge required.
ta: கோப்பு நிலை ஒன்றிணைப்பு தேவை.

source: Staying on branch '%s'.
ta: கிளையில் '%s'.

source: You are no longer on a local branch. If you wanted to be on a branch, create one now starting from 'This Detached Checkout'.
ta: நீங்கள் இனி உள்ளக கிளையில் இல்லை. நீங்கள் ஒரு கிளையில் இருக்க விரும்பினால், இப்போது 'இந்த பிரிக்கப்பட்ட புதுப்பித்தலில்' தொடங்கி ஒன்றை உருவாக்கவும்.

source: Checked out '%s'.
ta: '%s' சரிபார்க்கப்பட்டது.

source: Resetting '%s' to '%s' will lose the following commits:
ta: '%s' க்கு '%s' க்கு மீட்டமைப்பது பின்வரும் கமிட்டுகளை இழக்கும்:

source: Recovering lost commits may not be easy.
ta: இழந்த கமிட்டுகளை மீட்டெடுப்பது எளிதானது அல்ல.

source: Reset '%s'?
ta: '%s' மீட்டமைக்கவா?

source: Visualize
ta: காட்சிப்படுத்துங்கள்

source: Reset
ta: மீட்டமை

source: Failed to set current branch. This working directory is only partially switched. We successfully updated your files, but failed to update an internal Git file. This should not have occurred. %s will now close and give up.
ta: தற்போதைய கிளையை அமைப்பதில் தோல்வி. இந்த வேலை அடைவு ஓரளவு மட்டுமே மாற்றப்படுகிறது. உங்கள் கோப்புகளை நாங்கள் வெற்றிகரமாக புதுப்பித்தோம், ஆனால் உள் அறிவிலி கோப்பைப் புதுப்பிக்கத் தவறிவிட்டோம். இது நிகழ்ந்திருக்கக்கூடாது. %s இப்போது மூடப்பட்டு கைவிடப்படும்.

source: %s (%s): Add Remote
ta: %s (%s): ரிமோட்டைச் சேர்க்கவும்

source: Add New Remote
ta: புதிய ரிமோட்டைச் சேர்க்கவும்

source: Add
ta: கூட்டு

source: Remote Details
ta: தொலை விவரங்கள்

source: Name:
ta: பெயர்:

source: Location:
ta: இடம்:

source: Further Action
ta: மேலும் நடவடிக்கை

source: Fetch Immediately
ta: உடனடியாக வரும்

source: Initialize Remote Repository and Push
ta: தொலை களஞ்சியத்தை துவக்கி உந்துதல்

source: Do Nothing Else Now
ta: இப்போது வேறு எதுவும் செய்ய வேண்டாம்

source: Please supply a remote name.
ta: தொலைதூர பெயரை வழங்கவும்.

source: '%s' is not an acceptable remote name.
ta: '%s' என்பது ஏற்றுக்கொள்ளக்கூடிய தொலைநிலை பெயர் அல்ல.

source: Failed to add remote '%s' of location '%s'.
ta: இருப்பிடத்தின் தொலைதூர '%s' ஐ சேர்க்கத் தவறிவிட்டது '%s'.

source: Fetching the %s
ta: %s ஐப் பெறுகிறது

source: Do not know how to initialize repository at location '%s'.
ta: '%s' இருப்பிடத்தில் களஞ்சியத்தை எவ்வாறு தொடங்குவது என்று தெரியவில்லை.

source: Setting up the %s (at %s)
ta: %s ஐ அமைத்தல் ( %s இல்)

source: Starting...
ta: தொடங்குகிறது ...

source: %s (%s): File Browser
ta: %s (%s): கோப்பு உலாவி

source: Loading %s...
ta: %s ஏற்றுகிறது ...

source: [Up To Parent]
ta: [பெற்றோர் வரை]

source: %s (%s): Browse Branch Files
ta: %s (%s): கிளை கோப்புகளை உலாவுக

source: Browse Branch Files
ta: கிளை கோப்புகளை உலாவுக

source: Browse
ta: உலாவு

source: Revision
ta: திருத்தம்

source: Unable to unlock the index.
ta: குறியீட்டைத் திறக்க முடியவில்லை.

source: Index Error
ta: குறியீட்டு பிழை

source: Updating the Git index failed. A rescan will be automatically started to resynchronize git-gui.
ta: அறிவிலி குறியீட்டைப் புதுப்பிப்பது தோல்வியடைந்தது. கிட்-GUI ஐ மீண்டும் ஒத்திசைக்க ஒரு ரெச்கான் தானாகவே தொடங்கப்படும்.

source: Continue
ta: தொடரவும்

source: Unlock Index
ta: குறியீட்டைத் திறக்கவும்

source: files
ta: கோப்புகள்

source: Unstaging selected files from commit
ta: கமிட்டிலிருந்து தேர்ந்தெடுக்கப்பட்ட கோப்புகளைத் தூண்டுகிறது

source: Unstaging %s from commit
ta: கமிட்டிலிருந்து %s

source: Ready to commit.
ta: செய்ய தயாராக உள்ளது.

source: Adding selected files
ta: தேர்ந்தெடுக்கப்பட்ட கோப்புகளைச் சேர்ப்பது

source: Adding %s
ta: %s ஐ சேர்க்கிறது

source: Stage %d untracked files?
ta: நிலை %d கட்டுப்படுத்தப்படாத கோப்புகள்?

source: Adding all changed files
ta: மாற்றப்பட்ட அனைத்து கோப்புகளையும் சேர்க்கிறது

source: Revert changes in file %s?
ta: கோப்பு %s இல் மாற்றங்களை மாற்றியமைக்கவா?

source: Revert changes in these %i files?
ta: இந்த %i கோப்புகளில் மாற்றங்களை மாற்றியமைக்கவா?

source: Any unstaged changes will be permanently lost by the revert.
ta: எந்தவொரு நிலையற்ற மாற்றங்களும் தலைகீழ் மூலம் நிரந்தரமாக இழக்கப்படும்.

source: Do Nothing
ta: எதுவும் செய்ய வேண்டாம்

source: Delete untracked file %s?
ta: கட்டுப்படுத்தப்படாத கோப்பு %s ஐ நீக்கவா?

source: Delete these %i untracked files?
ta: இந்த %நான் கட்டுப்படுத்தப்படாத கோப்புகளை நீக்கவா?

source: Files will be permanently deleted.
ta: கோப்புகள் நிரந்தரமாக நீக்கப்படும்.

source: Delete Files
ta: கோப்புகளை நீக்கு

source: Deleting
ta: நீக்குதல்

source: Encountered errors deleting files:
ta: கோப்புகளை நீக்குவது பிழைகள்:

source: None of the %d selected files could be deleted.
ta: %d தேர்ந்தெடுக்கப்பட்ட கோப்புகள் எதுவும் நீக்க முடியாது.

source: %d of the %d selected files could not be deleted.
ta: %d தேர்ந்தெடுக்கப்பட்ட கோப்புகளின் %d ஐ நீக்க முடியவில்லை.

source: Reverting selected files
ta: தேர்ந்தெடுக்கப்பட்ட கோப்புகளை மாற்றியமைத்தல்

source: Reverting %s
ta: %s மாற்றும்

source: %s (%s): Checkout Branch
ta: %s (%s): புதுப்பித்து கிளை

source: Checkout Branch
ta: புதுப்பித்து கிளை

source: Checkout
ta: புதுப்பித்து

source: Options
ta: விருப்பங்கள்

source: Fetch Tracking Branch
ta: கண்காணிப்பு கிளையைப் பெறுங்கள்

source: Detach From Local Branch
ta: உள்ளக கிளையிலிருந்து பிரிக்கவும்

source: Push to
ta: தள்ளுங்கள்

source: Remove Remote
ta: ரிமோட்டை அகற்று

source: Prune from
ta: இருந்து கத்தரிக்காய்

source: Fetch from
ta: இருந்து பெறுங்கள்

source: All
ta: அனைத்தும்

source: %s (%s): Rename Branch
ta: %s (%s): கிளை மறுபெயரிடுதல்

source: Rename Branch
ta: கிளை மறுபெயரிடுக

source: Rename
ta: மறுபெயரிடுங்கள்

source: Branch:
ta: கிளை:

source: New Name:
ta: புதிய பெயர்:

source: Please select a branch to rename.
ta: மறுபெயரிட ஒரு கிளையைத் தேர்ந்தெடுக்கவும்.

source: Please supply a branch name.
ta: தயவுசெய்து ஒரு கிளை பெயரை வழங்கவும்.

source: '%s' is not an acceptable branch name.
ta: '%s' என்பது ஏற்றுக்கொள்ளக்கூடிய கிளை பெயர் அல்ல.

source: Failed to rename '%s'.
ta: '%s' என மறுபெயரிடுவதில் தோல்வி.

source: Select
ta: தேர்ந்தெடு

source: Font Family
ta: எழுத்துரு குடும்பம்

source: Font Size
ta: எழுத்துரு அளவு

source: Font Example
ta: எழுத்துரு சான்று

source: This is example text. If you like this text, it can be your font.
ta: இது எடுத்துக்காட்டு உரை. இந்த உரையை நீங்கள் விரும்பினால், அது உங்கள் எழுத்துருவாக இருக்கலாம்.

source: Invalid global encoding '%s'
ta: தவறான உலகளாவிய குறியாக்கம் '%s'

source: Invalid repo encoding '%s'
ta: தவறான ரெப்போ குறியீட்டு '%s'

source: Restore Defaults
ta: இயல்புநிலைகளை மீட்டெடுங்கள்

source: Save
ta: சேமி

source: %s Repository
ta: %s களஞ்சியம்

source: Global (All Repositories)
ta: உலகளாவிய (அனைத்து களஞ்சியங்களும்)

source: User Name
ta: பயனர் பெயர்

source: Email Address
ta: மின்னஞ்சல் முகவரி

source: Summarize Merge Commits
ta: சுருக்கம் ஒன்றிணைப்பு கமிட்டுகள்

source: Merge Verbosity
ta: சொற்களஞ்சியத்தை ஒன்றிணைக்கவும்

source: Show Diffstat After Merge
ta: ஒன்றிணைந்த பிறகு டிஃப்ச்டாட்டைக் காட்டு

source: Use Merge Tool
ta: ஒன்றிணைக்கும் கருவியைப் பயன்படுத்தவும்

source: Trust File Modification Timestamps
ta: கோப்பு மாற்றியமைக்கும் நேர முத்திரைகளை நம்புங்கள்

source: Prune Tracking Branches During Fetch
ta: பெறும்போது கிளைகளை கண்காணிக்கும் கிளைகளை கத்தரிக்காய்

source: Match Tracking Branches
ta: கண்காணிப்பு கிளைகளை பொருத்தவும்

source: Use Textconv For Diffs and Blames
ta: வேறுபாடுகள் மற்றும் குற்றவாளிகளுக்கு TextConv ஐப் பயன்படுத்தவும்

source: Blame Copy Only On Changed Files
ta: மாற்றப்பட்ட கோப்புகளில் மட்டுமே நகலை குறை கூறுங்கள்

source: Maximum Length of Recent Repositories List
ta: அண்மைக் கால களஞ்சியங்களின் பட்டியலின் அதிகபட்ச நீளம்

source: Minimum Letters To Blame Copy On
ta: நகலைக் குறை கூற குறைந்தபட்ச கடிதங்கள்

source: Blame History Context Radius (days)
ta: வரலாற்று சூழல் ஆரம் (நாட்கள்)

source: Number of Diff Context Lines
ta: வேறுபட்ட சூழல் வரிகளின் எண்ணிக்கை

source: Additional Diff Parameters
ta: கூடுதல் வேறுபாடு அளவுருக்கள்

source: Commit Message Text Width
ta: செய்தி உரை அகலத்தை செய்யுங்கள்

source: New Branch Name Template
ta: புதிய கிளை பெயர் வார்ப்புரு

source: Default File Contents Encoding
ta: இயல்புநிலை கோப்பு உள்ளடக்கங்கள் குறியாக்கம்

source: Warn before committing to a detached head
ta: பிரிக்கப்பட்ட தலையில் ஈடுபடுவதற்கு முன் எச்சரிக்கவும்

source: Staging of untracked files
ta: கட்டுப்படுத்தப்படாத கோப்புகளின் நிலை

source: Show untracked files
ta: கட்டுப்படுத்தப்படாத கோப்புகளைக் காட்டு

source: Tab spacing
ta: தாவல் இடைவெளி

source: Change
ta: மாற்றம்

source: Spelling Dictionary:
ta: எழுத்துப்பிழை அகராதி:

source: Change Font
ta: எழுத்துருவை மாற்றவும்

source: Choose %s
ta: %s ஐத் தேர்வுசெய்க

source: pt.
ta: பக்.

source: Preferences
ta: விருப்பத்தேர்வுகள்

source: Failed to completely save options:
ta: விருப்பங்களை முழுமையாக சேமிப்பதில் தோல்வி:

source: Default
ta: இயல்புநிலை

source: System (%s)
ta: அமைப்பு (%s)

source: Other
ta: மற்றொன்று

source: Running %s requires a selected file.
ta: %s இயங்குவதற்கு தேர்ந்தெடுக்கப்பட்ட கோப்பு தேவை.

source: Are you sure you want to run %1$s on file "%2$s"?
ta: " %2$s" கோப்பில் %1$s ஐ இயக்க விரும்புகிறீர்களா?

source: Are you sure you want to run %s?
ta: நீங்கள் %s ஐ இயக்க விரும்புகிறீர்களா?

source: Tool: %s
ta: கருவிகள்

source: Running: %s
ta: இயங்கும்: %s

source: Tool completed successfully: %s
ta: கருவி வெற்றிகரமாக முடிந்தது: %s

source: Tool failed: %s
ta: கருவி தோல்வியுற்றது: %s

source: Force resolution to the base version?
ta: அடிப்படை பதிப்பிற்கு ஆற்றல் தீர்மானம்?

source: Force resolution to this branch?
ta: இந்த கிளைக்கு ஆற்றல் தீர்மானம்?

source: Force resolution to the other branch?
ta: மற்ற கிளைக்கு ஆற்றல் தீர்மானம்?

source: Note that the diff shows only conflicting changes. %s will be overwritten. This operation can be undone only by restarting the merge.
ta: வேறுபாடு முரண்பட்ட மாற்றங்களை மட்டுமே காட்டுகிறது என்பதை நினைவில் கொள்க. %s மேலெழுதப்படும். ஒன்றிணைப்பை மறுதொடக்கம் செய்வதன் மூலம் மட்டுமே இந்த செயல்பாட்டை செயல்தவிர்க்க முடியும்.

source: File %s seems to have unresolved conflicts, still stage?
ta: கோப்பு %s தீர்க்கப்படாத மோதல்களைக் கொண்டிருப்பதாகத் தெரிகிறது, இன்னும் நிலை?

source: Adding resolution for %s
ta: %s க்கான தீர்மானத்தை சேர்க்கிறது

source: Cannot resolve deletion or link conflicts using a tool
ta: ஒரு கருவியைப் பயன்படுத்தி நீக்குதல் அல்லது இணைப்பு மோதல்களைத் தீர்க்க முடியாது

source: Conflict file does not exist
ta: மோதல் கோப்பு இல்லை

source: Not a GUI merge tool: '%s'
ta: GUI ஒன்றிணைக்கும் கருவி அல்ல: '%s'

source: Unsupported merge tool '%s'
ta: ஆதரிக்கப்படாத ஒன்றிணைக்கும் கருவி '%s'

source: Merge tool is already running, terminate it?
ta: ஒன்றிணைக்கும் கருவி ஏற்கனவே இயங்குகிறது, அதை நிறுத்தவா?

source: Error retrieving versions: %s
ta: பதிப்புகளை மீட்டெடுப்பதில் பிழை: %s

source: Could not start the merge tool: %s
ta: ஒன்றிணைக்கும் கருவியைத் தொடங்க முடியவில்லை: %s

source: Running merge tool...
ta: ஒன்றிணைக்கும் கருவி இயங்கும் ...

source: Merge tool failed.
ta: ஒன்றிணைக்கும் கருவி தோல்வியடைந்தது.

source: %s (%s): Add Tool
ta: %s (%s): கருவியைச் சேர்க்கவும்

source: Add New Tool Command
ta: புதிய கருவி கட்டளையைச் சேர்க்கவும்

source: Add globally
ta: உலகளவில் சேர்க்கவும்

source: Tool Details
ta: கருவி விவரங்கள்

source: Use '/' separators to create a submenu tree:
ta: ஒரு துணை மரத்தை உருவாக்க '/' பிரிப்பான்களைப் பயன்படுத்தவும்:

source: Command:
ta: கட்டளை:
